

//#include "Chapter05.h"


// 第05章 基础题目选解


// __________________________5.1 字符串__________________________






// __________________________5.2 高精度运算__________________________




// __________________________5.5 训练参考__________________________

// 5.5.1 黑盒测试[p102(102/241)]


// 5.5.2 在线评测系统
/*
	在线评测系统(Online Judge, OJ)为平时练习和网上竞赛提供了一个很好的平台。
	事实上，本书中的练习大都通过OJ给出。

	首先，要向读者介绍的是历史最悠久，最著名的OJ-西班牙Valladolid大学的【UVaOJ】
	http://uva.onlinejudge.org/			【被墙了，MD，而本书每章后面大量的习题都是要到这个网站上去做的】

	第2个要介绍的是浙江大学的【ZOJ】
	http://acm.zju.edu.cn/ 		【只有英文，不支持其他语言显示】

	第3个要介绍的北京大学的【POJ】
	http://acm.pku.edu.cn/		【多语言版】
*/