

//#include "Chapter01.h"


// 第01章 程序设计入门


// __________________________1.1 算术表达式__________________________
// 程序 1-2 计算并输出 8/5的值，保留小数点后1位
	printf("%d\n",8/5);				// 1
	printf("%lf\n",8.0/5.0);		// 1.600000
	printf("%2lf\n",8.0/5.0);		// 1.600000
	printf("%.1lf\n",8.0/5.0);		// 1.6

	printf("%.1lf\n",8/5);			// 0.0				//出现这2个结果的原因 涉及 整数和浮点数编码
	printf("%d\n\n",8.0/5.0);		// -1717986918 


// 程序 1-3 复杂的表达式计算
	printf("%.8lf\n",1+2*sqrt(3)/(5-0.1));


	system("pause");	//  加上这句后，控制台显示运行结果后会显示“请按任意键继续”

/*
	提示1-1：整数值用%d输出，实数用%lf输出
	提示1-2：整数/整数=整数，浮点数/浮点数=浮点数
*/


// __________________________1.2 变量及其输入__________________________
// 程序 1-4 A+B 问题
	int a,b;
	//scanf("%d%d",&a,&b);		// C 语言版本
	cin>>a;						// C++ 语言版本
	cin>>b;
	printf("%d\n",a+b);

// 程序1-5 圆柱体的表面积
	const double pi = 4.0*atan(1.0);
	double r,h,s1,s2,s;
	cin>>r;
	cin>>h;

	s1 = pi*r*r;
	s2 = 2*pi*r*h;
	s = s1*2.0 + s2;
	printf("Area = %.3lf\n",s);



// __________________________1.3 顺序结构程序设计__________________________
/*
	例题：1-2 三位数反转
	输入一个三位数，分离出它的百位、十位和个位，反转后输出
	cin>> 127
	cout>> 721
*/
// 程序1-7 三位数反转
for ( ;1;)		// 加了for循环来不停的输入数据。
{
	int n,m;
	cin>>n;

	m = (n%10)*100 + (n/10%10)*10 + (n/100);
	printf("%03d\n",m);
	printf("%d\n",m);
	printf("%02d\n\n",m);
}

/*
%d就是普通的输出了
%2d是将数字按宽度为2，采用右对齐方式输出，若数据位数不到2位，则左边补空格
%02d，和%2d差不多，只不过左边补0
*/

/*
	例题：1-3 交换变量
	输入两个整数a和b,交换二者的值，然后输出。
	样例输入：824  16
	样例输出：16   824
*/
// 程序1-8 变量交换

// __________________________1.4 分支结构程序设计__________________________
/*
	例题：1-4 鸡兔同笼
	已知鸡和兔的总数量为n,总腿数为m.依次输出鸡的数目和兔的数目。
	如果无解，则输出“No answer”
*/
// 程序1-11 鸡兔同笼


/*
	例题：1-5 三整数排序
	输入3个整数，从小到大排序后输出。
	样例输入：20 7 33
	样例输出：7 20 33
*/


// __________________________1.5 小结与习题__________________________


/*
	1.5.6 上机练习  -P30/241
	有大量的习题，太简单了。。。。
*/ 







