

// 第1章-面试的流程


// __________________________ 第1章-面试的流程 __________________________
/*
习惯01：
	做完题后，习惯的写下 单元测试。相当于 证明了自己有这专业的软件开发经验。

	但是如果是 先写单元测试用例，再写解决问题的函数。面试官绝对我刮目相看，
	因为能做到测试在前，开发往后的程序实在是太稀缺了。

【那得多熟悉那个问题才能先写单元测试啊，如果是完全没做过的新题目，
	要边写边想如何解决的，肯定就无法做到 先写单元测试用例了。】

面试小提示：__________________________ 	
	平时写代码时，要注意是否考虑了：
	01-边界条件
	02-特殊输入（比如 NULL 指针，空字符串等）及错误处理。

面试小提示：__________________________ 
	我们平时有3种办法分析，解决复杂的问题：
	01-画图能使抽象问题形象化
	02-举例使抽象问题具体化
	03-分解使复杂问题简单化

*/


/*
	

	作者：何海涛。
	任职经历：
	01-在Autodesk公司做的是 面向土木的软件。
	02-微软做维护 Winforms，2.5年
	03-思科做网络。
*/


	
